{
    "format": "layers-model",
    "generatedBy": "tfjs-converter",
    "convertedBy": "TensorFlow.js",
    "modelTopology": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "rate": 0.2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "rate": 0.2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "units": 8,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "weightsManifest": [
      {
        "paths": [
          "group1-shard1of1.bin"
        ],
        "weights": [
          {
            "name": "dense/kernel",
            "shape": [16, 64],
            "dtype": "float32"
          },
          {
            "name": "dense/bias",
            "shape": [64],
            "dtype": "float32"
          },
          {
            "name": "dense_1/kernel",
            "shape": [64, 32],
            "dtype": "float32"
          },
          {
            "name": "dense_1/bias",
            "shape": [32],
            "dtype": "float32"
          },
          {
            "name": "dense_2/kernel",
            "shape": [32, 8],
            "dtype": "float32"
          },
          {
            "name": "dense_2/bias",
            "shape": [8],
            "dtype": "float32"
          }
        ]
      }
    ]
  }